; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	image1 - mode
	thermograph0 - mode
	image2 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation14 - direction
	Star11 - direction
	GroundStation6 - direction
	GroundStation13 - direction
	GroundStation12 - direction
	GroundStation2 - direction
	Star7 - direction
	Star4 - direction
	GroundStation8 - direction
	GroundStation10 - direction
	GroundStation3 - direction
	Star9 - direction
	Star5 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Star19 - direction
	Planet20 - direction
	Phenomenon21 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation14)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star9)
	(supports instrument1 image2)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 GroundStation10)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation13)
	(supports instrument2 thermograph0)
	(supports instrument2 image2)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation6)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation13)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation12)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument5 image2)
	(supports instrument5 image1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star7)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon15)
	(supports instrument6 image2)
	(supports instrument6 thermograph0)
	(supports instrument6 image1)
	(calibration_target instrument6 Star9)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 GroundStation10)
	(supports instrument7 image2)
	(supports instrument7 image1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star5)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation14)
)
(:goal (and
	(pointing satellite0 Star9)
	(pointing satellite3 Planet18)
	(have_image Phenomenon15 thermograph0)
	(have_image Phenomenon16 image2)
	(have_image Phenomenon17 thermograph0)
	(have_image Planet18 image2)
	(have_image Star19 image2)
	(have_image Planet20 image2)
	(have_image Phenomenon21 image2)
))

)

; plan
1. (turn_to satellite3 groundstation8 phenomenon15)
   deleted: (pointing satellite3 phenomenon15)
   added: (pointing satellite3 groundstation8)
   goals met: 0 of 9
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 9
3. (calibrate satellite3 instrument5 groundstation8)
   added: (calibrated instrument5)
   goals met: 0 of 9
4. (turn_to satellite3 phenomenon21 groundstation8)
   deleted: (pointing satellite3 groundstation8)
   added: (pointing satellite3 phenomenon21)
   goals met: 0 of 9
5. (take_image satellite3 phenomenon21 instrument5 image2)
   added: (have_image phenomenon21 image2)
   goals met: 1 of 9
6. (turn_to satellite3 phenomenon17 phenomenon21)
   deleted: (pointing satellite3 phenomenon21)
   added: (pointing satellite3 phenomenon17)
   goals met: 1 of 9
7. (take_image satellite3 phenomenon17 instrument5 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 2 of 9
8. (turn_to satellite3 phenomenon16 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 phenomenon16)
   goals met: 2 of 9
9. (take_image satellite3 phenomenon16 instrument5 image2)
   added: (have_image phenomenon16 image2)
   goals met: 3 of 9
10. (turn_to satellite3 phenomenon15 phenomenon16)
   deleted: (pointing satellite3 phenomenon16)
   added: (pointing satellite3 phenomenon15)
   goals met: 3 of 9
11. (take_image satellite3 phenomenon15 instrument5 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 4 of 9
12. (turn_to satellite0 star9 groundstation13)
   deleted: (pointing satellite0 groundstation13)
   added: (pointing satellite0 star9)
   goals met: 5 of 9
13. (turn_to satellite3 planet20 phenomenon15)
   deleted: (pointing satellite3 phenomenon15)
   added: (pointing satellite3 planet20)
   goals met: 5 of 9
14. (take_image satellite3 planet20 instrument5 image2)
   added: (have_image planet20 image2)
   goals met: 6 of 9
15. (turn_to satellite3 star19 planet20)
   deleted: (pointing satellite3 planet20)
   added: (pointing satellite3 star19)
   goals met: 6 of 9
16. (take_image satellite3 star19 instrument5 image2)
   added: (have_image star19 image2)
   goals met: 7 of 9
17. (turn_to satellite3 planet18 star19)
   deleted: (pointing satellite3 star19)
   added: (pointing satellite3 planet18)
   goals met: 8 of 9
18. (take_image satellite3 planet18 instrument5 image2)
   added: (have_image planet18 image2)
   goals met: 9 of 9
